app/Controllers/Customer_Dashboard.php

SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `cust_id` = '1'
---
    public function index()
    {
        if(session('type')=='customer'){
        $data['title'] = 'Dashboard';
        $p = new Seller_Products_Model();
        $o = new Orders_Model();
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();
        $data['total_orders']= $o->where('cust_id',session('id'))->countAllResults();