app/Controllers/Home.php

    public function index()
    {

        // echo "<pre>";
        // print_r($this->cart->contents());die();
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();
        $cat = new Sub_Categories_Model();
        $categories = new Categories_Model();
        $prod = new Seller_Products_Model();

        $data['categories'] = $categories->findAll(7);
        $data['categorie'] = $categories->findAll();
---
SELECT *
FROM `categories`
 LIMIT 7
SELECT *
FROM `categories`

        $data['men'] = $prod->where('cat_id', 6)->orderBy('prod_id', 'desc')->findAll();
        $data['computerBanner4'] = $cat->where('cat_id', 6)->orderBy('cat_id', 'desc')->findAll(3);

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();
---
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1

    public function singleProduct($id = null)
    {
        $brands = new Brands_Model();
        $contact = new Contact_Model();
        // $cat = new Categories_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();
        $prod = new Seller_Products_Model();
        $seller = new Seller_Model();
        $brands = new Brands_Model();
        $img = new Add_Product_Model();
        if($prod->find($id)){
        $data['product'] = $prod->where('prod_id', $id)->first();
        $data['brand'] = $brands->where('brand_id', $data['product']['brand_id'])->first();
        $data['seller'] = $seller->where('seller_id', $data['product']['user_id'])->first();
        $data['images'] = $img->where('prod_id', $data['product']['prod_id'])->findAll();
        $data['brandProducts'] = $prod->where('cat_id', $data['product']['cat_id'])->findAll();


        $data['title'] = $data['product']['prod_name'];

        $data['brands'] = $brands->findAll();
        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();
---
SELECT *
FROM `products`
WHERE `prod_id` = '1'
 LIMIT 1
SELECT *
FROM `brands`
WHERE `brand_id` = '13'
 LIMIT 1
SELECT *
FROM `sellers`
WHERE `seller_id` = '8'
 LIMIT 1
SELECT *
FROM `products`
WHERE `cat_id` = '1'
SELECT *
FROM `brands`
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1

    public function categoryProducts($id = null)
    {

        $brands = new Brands_Model();
        $cat = new Categories_Model();
        $sub_cat = new Sub_Categories_Model();
        $prod = new Seller_Products_Model();
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();
        $data['b'] = $brands->findAll();

        $data['category'] = $cat->where('cat_id', $id)->first();
        $data['sub_cat'] = $sub_cat->where('cat_id', $id)->findAll();

        $data['products'] = $prod->where('cat_id', $id)->findAll();
---
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1
SELECT *
FROM `categories`
WHERE `cat_id` = '1'
 LIMIT 1
SELECT *
FROM `products`
WHERE `cat_id` = '1'