app/Controllers/Registration_Seller.php

SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1
---
    public function index()
    {
        $data = [];
        $data['title'] = 'Seller Registration';
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();