app/Controllers/Seller_Shop.php

    public function index(){
        $model = new Shop_Model();
        $data = [];
        $data['title'] = 'Shop Setting';
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();

        $data['shop'] = $model->where('user_id',session('id'))->first();
---
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1
SELECT *
FROM `shops`
WHERE `user_id` = '14'
 LIMIT 1