app/Controllers/Seller_Login.php

    public function index()
    {
        $data = [];
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();
---
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1

    public function verifyUser()
    {

        $data = [];
        $contact = new Contact_Model();
        $logo = new Logos_Model();
        $Footer = new Footer_Model();
        $link = new Links_Model();
        $data['title'] = 'Seller Login';

        $data['link'] = $link->first();
        $data['footer'] = $Footer->first();
        $data['contact'] = $contact->first();
        $data['logo'] = $logo->first();
---
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1

            $userdata = $sellermodel->verifyEmail($email);
            $uniid = $userdata['uniid'];
            $fullname = $userdata['seller_name'];
            $seller_info  = $sellermodel->where('seller_email', $email)->first();
---
SELECT *
FROM `sellers`
WHERE `seller_email` = '1980191@szabist-isb.pk'
 LIMIT 1

                    session()->setFlashdata('incorrect', 'Email or password don\'t match');
                    return redirect()->to('/seller/login');
                } else {
                    $data['link'] = $link->first();
                    $data['footer'] = $Footer->first();
                    $data['contact'] = $contact->first();
                    $data['logo'] = $logo->first();
---
SELECT *
FROM `links`
 LIMIT 1
SELECT *
FROM `footer`
 LIMIT 1
SELECT *
FROM `contacts`
 LIMIT 1
SELECT *
FROM `logos`
 LIMIT 1