app/Models/Seller_Model.php

    public function verifyEmail($email){

        $builder = $this->db->table('sellers');
        $builder->select("uniid,status,seller_name,seller_password");
        $builder->where('seller_email',$email);
        $result = $builder->get();
---
SELECT `uniid`, `status`, `seller_name`, `seller_password`
FROM `sellers`
WHERE `seller_email` = '1980191@szabist-isb.pk'